spec/fixtures/vcr_cassettes/threeds_payment_create/successful.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox-api.iyzipay.com/payment/iyzipos/auth3ds/ecom
    body:
      encoding: UTF-8
      string: '{"paymentId":"393562","locale":"tr"}'
    headers:
      User-Agent:
      - Faraday v1.0.1
      Accept:
      - application/json
      Content-Type:
      - application/json
      Authorization:
      - IYZWS sandbox-lYXmlBGjvZawww9mhoj7Mef89uZ1bybo:EL5kMj5jCJYn9K1WLzKkpZV16IA=
      X-Iyzi-Rnd:
      - random_string
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Application-Context:
      - iyzipay-payment-api:sandbox:8080
      Content-Type:
      - application/json;charset=UTF-8
      Transfer-Encoding:
      - chunked
      Date:
      - Mon, 19 Jun 2017 11:42:43 GMT
    body:
      encoding: UTF-8
      string: '{"status":"success","locale":"tr","systemTime":1497872563732,"price":10.00000000,"paidPrice":10.00000000,"installment":1,"paymentId":"393562","fraudStatus":1,"merchantCommissionRate":0E-8,"merchantCommissionRateAmount":0E-8,"iyziCommissionRateAmount":0.26250000,"iyziCommissionFee":0.22245763,"cardType":"CREDIT_CARD","cardAssociation":"MASTER_CARD","cardFamily":"Axess","binNumber":"552608","lastFourDigits":"0006","currency":"TRY","itemTransactions":[{"itemId":"BI101","paymentTransactionId":"578955","transactionStatus":2,"price":10.00000000,"paidPrice":10.00000000,"merchantCommissionRate":0E-8,"merchantCommissionRateAmount":0E-8,"iyziCommissionRateAmount":0.26250000,"iyziCommissionFee":0.22245763,"blockageRate":10.00000000,"blockageRateAmountMerchant":1.00000000,"blockageRateAmountSubMerchant":0,"blockageResolvedDate":"2017-06-26
        14:42:43","subMerchantPrice":0,"subMerchantPayoutRate":0E-8,"subMerchantPayoutAmount":0,"merchantPayoutAmount":8.51504237,"convertedPayout":{"paidPrice":10.00000000,"iyziCommissionRateAmount":0.26250000,"iyziCommissionFee":0.22245763,"blockageRateAmountMerchant":1.00000000,"blockageRateAmountSubMerchant":0E-8,"subMerchantPayoutAmount":0E-8,"merchantPayoutAmount":8.51504237,"iyziConversionRate":0,"iyziConversionRateAmount":0,"currency":"TRY"}}],"authCode":"mock00007iyziauthcd","phase":"AUTH"}'
    http_version: 
  recorded_at: Mon, 19 Jun 2017 11:42:43 GMT
recorded_with: VCR 3.0.3
